Conf.Simple/src/InformationRegisters/SUI_ПотокШтрихкодов/SUI_ПотокШтрихкодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ПотокШтрихкодов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОбмена</name>
    <type>
      <types>DocumentRef.SUI_ДокументОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_tbl_barcodes/SUI_tbl_barcodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_tbl_barcodes</name>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_property</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ratio</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоДополнительнаяЗапись</name>
    <comment>[service field]</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_ПотокШтрихкодов/Forms/ФормаПотокШтрихкодов/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбработанныеШтрихкоды;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбмена = Параметры.ДокументОбмена;
	ИдентификаторВладельца = Параметры.ИдентификаторВладельца;
	
	Если Не ПустаяСтрока(Параметры.ЗаголовокКнопкиВыбор) Тогда
		Элементы.ПотокШтрихкодовПодтвердитьВыбор.Заголовок = Параметры.ЗаголовокКнопкиВыбор;
	КонецЕсли;
	
	ИнициализироватьРеквизитыТабличнойЧастиПотокШтрихкодов();
	
	ОтображатьСопоставленные = Истина;
	ОтображатьНесопоставленные = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьДлительнуюОперацию(НСтр("ru = 'Получение данных потока штрихкодов'"));
	ПодключитьОбработчикОжидания("НачатьЗагрузкуДанныхПотокаШтрихкодов", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтображатьСопоставленныеПриИзменении(Элемент)
	
	УстановитьОтборВТабличнойЧастиПотокШтрихкодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНесопоставленныеПриИзменении(Элемент)
	
	УстановитьОтборВТабличнойЧастиПотокШтрихкодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотокШтрихкодовРеквизитПриИзменении(Элемент)
	
	Если Элемент.Родитель.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РедактируемыеДанные = Новый Структура("Номенклатура,Характеристика,Упаковка");
	ЗаполнитьЗначенияСвойств(РедактируемыеДанные, Элемент.Родитель.ТекущиеДанные);
	
	РедактируемыеДанныеЗаполнены = Ложь;
	Для Каждого ЭлементРедактируемыхДанных Из РедактируемыеДанные Цикл
		
		Если ЗначениеЗаполнено(ЭлементРедактируемыхДанных.Значение) Тогда
			РедактируемыеДанныеЗаполнены = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не РедактируемыеДанныеЗаполнены Тогда
		Элемент.Родитель.ТекущиеДанные.Сопоставлен = Ложь;
		Возврат;
	КонецЕсли;
	
	НачальныеДанные = Новый Структура();
	Для Каждого РедактируемыеДанныеКлючЗначение Из РедактируемыеДанные Цикл
		НачальныеДанные.Вставить(РедактируемыеДанныеКлючЗначение.Ключ + "_НачальноеЗначение");
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(НачальныеДанные, Элемент.Родитель.ТекущиеДанные);
	
	Элемент.Родитель.ТекущиеДанные.Сопоставлен = (РедактируемыеДанные = НачальныеДанные);
	Элемент.Родитель.ТекущиеДанные.Модифицированность = Не Элемент.Родитель.ТекущиеДанные.Сопоставлен;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)
	
	Отказ = Ложь;
	
	Для Каждого СтрокаПотока Из ПотокШтрихкодов.НайтиСтроки(Новый Структура("Выбран,Сопоставлен", Истина, Ложь)) Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Штрихкод %1 не сопоставлен'"), СтрокаПотока.Штрихкод), , 
			"ПотокШтрихкодов", , Отказ);
	КонецЦикла;
	
	Для Каждого СтрокаПотока Из ПотокШтрихкодов.НайтиСтроки(Новый Структура("Выбран,Модифицированность", Истина, Истина)) Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Штрихкод %1 не записан'"), СтрокаПотока.Штрихкод), , 
			"ПотокШтрихкодов", , Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ПодготовитьРезультатВыбораНаСервере());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	УстановитьСнятьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	УстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСопоставлениеШтрихкодов(Команда)
	
	Если ПотокШтрихкодов.НайтиСтроки(Новый Структура("Выбран,Сопоставлен", Истина, Ложь)).Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны штрихкоды к записи сопоставления.'"));
		Возврат;
	КонецЕсли;
	
	Если ПотокШтрихкодов.НайтиСтроки(Новый Структура("Выбран,Модифицированность", Истина, Истина)).Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для выбранных штрихкодов запись сопоставления не требуется.'"));
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьЗаписатьСопоставлениеШтрихкодовЗавершение", ЭтотОбъект);
	ДлительнаяОперация = НачатьЗаписатьСопоставлениеШтрихкодовНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Запись сопоставления штрихкодов'");
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьРеквизитыТабличнойЧастиПотокШтрихкодов()
	
	РеквизитыКДобавлению = Новый Структура();
	
	ПараметрыНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек(
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	ПараметрыНастроек.ОсновнойОбъект = Неопределено;
	
	Для Каждого НастройкаТаблицы Из РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыНастроек) Цикл
		
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, НастройкаТаблицы.СхемаКомпоновкиДанных,
			НастройкаТаблицы.НастройкиКомпоновкиДанных, СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		
		Для Каждого ЭлементВыбора Из Компоновщик.Настройки.Выбор.Элементы Цикл
			
			Если Не ЭлементВыбора.Использование Или Не ЗначениеЗаполнено(ЭлементВыбора.Поле) Тогда
				Продолжить;
			КонецЕсли;
			
			ДоступноеПоле = Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбора.Поле);
			
			Если ДоступноеПоле = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭлементВыбора.Заголовок = "id_good" Тогда
				
				Если Не РеквизитыКДобавлению.Свойство("Номенклатура") Тогда
					РеквизитыКДобавлению.Вставить("Номенклатура", Новый Массив());
				КонецЕсли;
				
				ПриемникТипов = РеквизитыКДобавлению.Номенклатура;
				
			ИначеЕсли ЭлементВыбора.Заголовок = "id_property" Тогда
				
				Если Не РеквизитыКДобавлению.Свойство("Характеристика") Тогда
					РеквизитыКДобавлению.Вставить("Характеристика", Новый Массив());
				КонецЕсли;
				
				ПриемникТипов = РеквизитыКДобавлению.Характеристика;
				
			ИначеЕсли ЭлементВыбора.Заголовок = "id_unit" Тогда
				
				Если Не РеквизитыКДобавлению.Свойство("Упаковка") Тогда
					РеквизитыКДобавлению.Вставить("Упаковка", Новый Массив());
				КонецЕсли;
				
				ПриемникТипов = РеквизитыКДобавлению.Упаковка;
				
			Иначе
				Продолжить;
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПриемникТипов, ДоступноеПоле.ТипЗначения.Типы(), Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	Для Каждого РеквизитКДобавлению Из РеквизитыКДобавлению Цикл
    	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(РеквизитКДобавлению.Ключ, 
    		Новый ОписаниеТипов(РеквизитКДобавлению.Значение), "ПотокШтрихкодов", РеквизитКДобавлению.Ключ));
    	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(РеквизитКДобавлению.Ключ + "_НачальноеЗначение", 
    		Новый ОписаниеТипов(РеквизитКДобавлению.Значение), "ПотокШтрихкодов", РеквизитКДобавлению.Ключ + "(начальное значение)"));
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для индекс = 0 По ДобавляемыеРеквизиты.ВГраница() Цикл
		
		Если СтрЗаканчиваетсяНа(ДобавляемыеРеквизиты[индекс].Имя, "_НачальноеЗначение") Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент = Элементы.Добавить("ПотокШтрихкодов" + ДобавляемыеРеквизиты[индекс].Имя, Тип("ПолеФормы"), Элементы.ПотокШтрихкодов);
	    Элемент.Заголовок = ДобавляемыеРеквизиты[индекс].Заголовок;
	    Элемент.Вид = ВидПоляФормы.ПолеВвода;
	    Элемент.ПутьКДанным = ДобавляемыеРеквизиты[индекс].Путь + "." + ДобавляемыеРеквизиты[индекс].Имя;
		Элемент.УстановитьДействие("ПриИзменении", "ПотокШтрихкодовРеквизитПриИзменении");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьДлительнуюОперацию(Информация = "")
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	
	Если ПустаяСтрока(Информация) Тогда
		Элементы.ДлительнаяОперацияНадписьИнформация.Заголовок = НСтр("ru = 'Выполняется операция'");
	Иначе
		Элементы.ДлительнаяОперацияНадписьИнформация.Заголовок = Информация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуДанныхПотокаШтрихкодов() Экспорт
	
	Если ТипЗнч(ОбработанныеШтрихкоды) <> Тип("Массив") Тогда
		ШтрихкодыКПолучению = Неопределено;
	КонецЕсли;
	
	ШтрихкодыКПолучению = ОбработанныеШтрихкоды;
	
	НачатьЗагрузкуДанныхПотокаШтрихкодовНаСервере(ШтрихкодыКПолучению);
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПотокШтрихкодов;
	
КонецПроцедуры

&НаСервере
Процедура НачатьЗагрузкуДанныхПотокаШтрихкодовНаСервере(ШтрихкодыКПолучению = Неопределено)
	
	Если ШтрихкодыКПолучению = Неопределено Тогда
		ПотокШтрихкодов.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторЗаписи,
		|	Штрихкод КАК Штрихкод,
		|	Количество
		|ПОМЕСТИТЬ втПоток
		|ИЗ
		|	РегистрСведений.SUI_ПотокШтрихкодов
		|ГДЕ
		|	ДокументОбмена = &ДокументОбмена
		|	И ВЫБОР
		|		КОГДА &ОтборПоШтрихкодам
		|			ТОГДА Штрихкод В (&ШтрихкодыКПолучению)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Штрихкод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПоток.Штрихкод,
		|	СУММА(втПоток.Количество) КАК Количество,
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_good, """") КАК Номенклатура,
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_good, """") КАК Номенклатура_НачальноеЗначение,
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_property, """") КАК Характеристика,
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_property, """") КАК Характеристика_НачальноеЗначение,
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_unit, """") КАК Упаковка,
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_unit, """") КАК Упаковка_НачальноеЗначение,
		|	ВЫБОР
		|		КОГДА ТаблицаШтрихкоды.barcode ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Сопоставлен,
		|	ЛОЖЬ КАК Модифицированность
		|ИЗ
		|	втПоток КАК втПоток
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			barcode,
		|			id_good,
		|			id_property,
		|			id_unit
		|		ИЗ
		|			РегистрСведений.SUI_tbl_barcodes
		|		ГДЕ
		|			barcode В
		|				(ВЫБРАТЬ
		|					Штрихкод
		|				ИЗ
		|					втПоток)) КАК ТаблицаШтрихкоды
		|		ПО втПоток.Штрихкод = ТаблицаШтрихкоды.barcode
		|СГРУППИРОВАТЬ ПО
		|	втПоток.Штрихкод,
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_good, """"),
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_property, """"),
		|	ЕСТЬNULL(ТаблицаШтрихкоды.id_unit, """"),
		|	ВЫБОР
		|		КОГДА ТаблицаШтрихкоды.barcode ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДокументОбмена", ДокументОбмена);
	Запрос.УстановитьПараметр("ШтрихкодыКПолучению", ШтрихкодыКПолучению);
	Запрос.УстановитьПараметр("ОтборПоШтрихкодам", (ШтрихкодыКПолучению <> Неопределено));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Если РезультатыЗапроса[0].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаВсе = РезультатыЗапроса[0].Выбрать();
	Выборка = РезультатыЗапроса[1].Выбрать();
	
	СтрокиКУдалениюИзТЧ = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		Данные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(Данные, , Ложь);
		
		СтрокаПотока = ПотокШтрихкодов.НайтиСтроки(Новый Структура("Штрихкод", Данные.Штрихкод));
		
		Если СтрокаПотока.Количество() = 0 Тогда
			СтрокаПотока = ПотокШтрихкодов.Добавить();
		Иначе
			
			Для индекс = 1 По СтрокаПотока.ВГраница() Цикл
				СтрокиКУдалениюИзТЧ.Добавить(СтрокаПотока[индекс]);
			КонецЦикла;
			
			СтрокаПотока = СтрокаПотока[0];
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаПотока, Данные);
		
		ВыборкаВсе.Сбросить();
		Пока ВыборкаВсе.НайтиСледующий(Новый Структура("Штрихкод", СтрокаПотока.Штрихкод)) Цикл
			СтрокаПотока.ИдентификаторЗаписи.Добавить(ВыборкаВсе.ИдентификаторЗаписи);
		КонецЦикла;
		
	КонецЦикла;
	
	Если СтрокиКУдалениюИзТЧ.Количество() > 0 Тогда
		
		ТекущийИндекс = СтрокиКУдалениюИзТЧ.ВГраница();
		
		Пока ТекущийИндекс >= 0 Цикл
			ПотокШтрихкодов.Удалить(СтрокиКУдалениюИзТЧ[ТекущийИндекс]);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВТабличнойЧастиПотокШтрихкодов()
	
	Отбор = Новый Структура();
	
	Если ОтображатьСопоставленные И ОтображатьНесопоставленные Тогда
		Отбор = Неопределено;
	ИначеЕсли ОтображатьСопоставленные Тогда
		Отбор.Вставить("Сопоставлен", Истина);
	ИначеЕсли ОтображатьНесопоставленные Тогда
		Отбор.Вставить("Сопоставлен", Ложь);
	КонецЕсли;
	
	Если Отбор <> Неопределено Тогда
		Отбор = Новый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
	
	Элементы.ПотокШтрихкодов.ОтборСтрок = Отбор;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки(Значение)
	
	Если Элементы.ПотокШтрихкодов.ОтборСтрок = Неопределено Тогда
		
		Для Каждого СтрокаКОтметке Из ПотокШтрихкодов Цикл
			СтрокаКОтметке.Выбран = Значение;
		КонецЦикла;
		
	Иначе
		
		Отбор = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(Элементы.ПотокШтрихкодов.ОтборСтрок, Ложь);
		
		Для Каждого СтрокаКОтметке Из ПотокШтрихкодов.НайтиСтроки(Отбор) Цикл
			СтрокаКОтметке.Выбран = Значение;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаписатьСопоставлениеШтрихкодовНаСервере()
	
	КолонкиКВыгрузке = Новый Массив();
	Для Каждого Колонка Из ПотокШтрихкодов.Выгрузить(Новый Структура("Количество", -1)).Колонки Цикл
		
		Если СтрЗаканчиваетсяНа(Колонка.Имя, "_НачальноеЗначение") Тогда
			КолонкиКВыгрузке.Добавить(СтрЗаменить(Колонка.Имя, "_НачальноеЗначение", ""));
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.Проверить(КолонкиКВыгрузке.Количество() > 0,
		НСтр("ru = 'Отсутствуют колонки с данными сопоставления'"));
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("Данные", ПотокШтрихкодов.Выгрузить(
		Новый Структура("Выбран,Модифицированность", Истина, Истина), "Штрихкод," + СтрСоединить(КолонкиКВыгрузке, ",")));
		
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.SUI_ПотокШтрихкодов.ЗаписатьСопоставлениеШтрихкодовВФоне", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура НачатьЗаписатьСопоставлениеШтрихкодовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Сообщения[индекс]);
		КонецЦикла;
		
	КонецЕсли;
	
	ТекстПредупреждения = "";
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		ОбработанныеШтрихкоды = РезультатОбработки.ОбработанныеШтрихкоды;
		
		Если ОбработанныеШтрихкоды.Количество() > 0 Тогда
			ОтобразитьДлительнуюОперацию(НСтр("ru = 'Получение данных потока штрихкодов'"));
			ПодключитьОбработчикОжидания("НачатьЗагрузкуДанныхПотокаШтрихкодов", 0.1, Истина);
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка.
		|%1'"), Результат.КраткоеПредставлениеОшибки);
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Не удалось получить результат выполнения операции.'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьРезультатВыбораНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторВладельца) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КолонкиКВыгрузке = СтрРазделить("Штрихкод,Количество,ИдентификаторЗаписи", ",");
	КолонкиДанных = СтрРазделить("Номенклатура,Упаковка,Характеристика", ",");
	
	Для Каждого Колонка Из ПотокШтрихкодов.Выгрузить(Новый Структура("Количество", -1)).Колонки Цикл
		
		Если КолонкиДанных.Найти(Колонка.Имя) <> Неопределено Тогда
			КолонкиКВыгрузке.Добавить(Колонка.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура("Выбран,Сопоставлен,Модифицированность", Истина, Истина, Ложь);
	ТаблицаРезультат = ПотокШтрихкодов.Выгрузить(ПараметрыОтбора, СтрСоединить(КолонкиКВыгрузке, ","));
	
	Для Каждого КолонкаКДобавлению Из ОбщегоНазначенияКлиентСервер.РазностьМассивов(КолонкиДанных, КолонкиКВыгрузке) Цикл
		ТаблицаРезультат.Колонки.Добавить(КолонкаКДобавлению);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаРезультат, ИдентификаторВладельца);
	
КонецФункции

#КонецОбласти
